; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block name)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       (name ?x - block ?y - name)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)

)

; problem
(define (problem BLOCKS)
(:domain BLOCKS)
(:objects A E P S T H Y O G D C R I - block)
(:INIT   (ONTABLE A)
         (CLEAR O) (ON O A)
         (ON E P)
         (ON I E) (CLEAR I)
         (ONTABLE P)
         (ONTABLE S)
         (ON T S) 
         (CLEAR T)
         (ONTABLE Y)
         (CLEAR Y) 
         (ONTABLE G) 
         (ON R G)(CLEAR R)
         (ONTABLE C) 
         (CLEAR C)
         (ONTABLE D)
         (CLEAR H) (ON H D)
         (HANDEMPTY)
)
(:goal (AND 
        (ONTABLE T)
        (ON A T)
        (ON C A)
        )
    )
)

; plan
1. (unstack t s)
   deleted: (clear t) (handempty) (on t s)
   added: (holding t) (clear s)
   goals met: 0 of 3
2. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 1 of 3
3. (unstack o a)
   deleted: (clear o) (handempty) (on o a)
   added: (holding o) (clear a)
   goals met: 1 of 3
4. (stack o r)
   deleted: (holding o) (clear r)
   added: (clear o) (handempty) (on o r)
   goals met: 1 of 3
5. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 1 of 3
6. (stack a t)
   deleted: (holding a) (clear t)
   added: (clear a) (handempty) (on a t)
   goals met: 2 of 3
7. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 2 of 3
8. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 3 of 3
